STMicroelectronics/STM32CubeWB/Projects/STM32WB5MM-DK/Applications/BLE/BLE_Mesh_Model_Sensor/STM32_WPAN/app/appli_sensor.c
  if (sensorOffset == 0)
  {
    if (fastCadenceLow <= fastCadenceHigh)
  {
      fastCadenceStatus = sensorValue >= fastCadenceLow &&
                          sensorValue <= fastCadenceHigh;
    }
    else
    {
      fastCadenceStatus = sensorValue > fastCadenceLow ||
                          sensorValue < fastCadenceHigh;
  }
}
  else
  {
    /* Implemented only for sensor at offset 0 */
  }
  
  return fastCadenceStatus;
}


/**
  * @brief  Callback corresponding to Sensor_IsStatusTrigger_cb
  *         To check if sensor change in sensor state (delta) is more than
  *         given trigger state value 
  *         delta up values
  * @param  Sensor offset in sensor init structure
  * @param  Trigger type -> value or percent change
  * @param  Status trigger delta down
  * @param  Status trigger delta up
  * @retval Trigger status
*/ 
MOBLEUINT8 Appli_Sensor_IsStatusTrigger(MOBLEUINT8 sensorOffset,
                                        status_trigger_type_e triggerType,
                                        void* pDeltaDown,
                                        void* pDeltaUp)
{
  const sensor_init_params_t* pSensorInitParams = NULL;
  MOBLEUINT8 triggerStatus = 0;
  MOBLEUINT32 deltaDown = *((MOBLEUINT32*)pDeltaDown);
  MOBLEUINT32 deltaUp = *((MOBLEUINT32*)pDeltaUp);
  status_trigger_delta_e statusTriggerDelta;
  MOBLEUINT32 delta;
  
  if (sensorOffset == 0)
  {
    if (PresentTemperatureValue < PreviousTemperatureValue)
    {
      /* status trigger delta down */
      statusTriggerDelta = STATUS_TRIGGER_DELTA_DOWN;
      delta = PreviousTemperatureValue - PresentTemperatureValue;

      TRACE_M(TF_SENSOR, "Delta down value %ld\r\n", delta);
    }
    else
    {
      /* status trigger delta up */
      statusTriggerDelta = STATUS_TRIGGER_DELTA_UP;
      delta = PresentTemperatureValue - PreviousTemperatureValue;

      TRACE_M(TF_SENSOR, "Delta up value %ld\r\n", delta);
    }
  
    if (triggerType == STATUS_TRIGGER_TYPE_PC)
    {
      pSensorInitParams = &(SensorServerInitParams.sensorInitParams[sensorOffset]);
    
      if (pSensorInitParams->valuesRange != 0)
      {
        /* change delta to percentage change (of 0.01 % steps) */
        delta = (MOBLEUINT32)((delta*10000)/pSensorInitParams->valuesRange);
      }
      else
      {
        triggerStatus = 0;
      }
    }
  
    if ((statusTriggerDelta == STATUS_TRIGGER_DELTA_DOWN && delta >= deltaDown) ||
        (statusTriggerDelta == STATUS_TRIGGER_DELTA_UP && delta >= deltaUp))
    {
      triggerStatus = 1;
    }
    else
    {
      triggerStatus = 0;
    }
  }

  return triggerStatus;
}
  
  
/**
* @brief  Initialize hardware interfaces for sensors and mesh sensor model structures
*         Sensor init parameters to be defined in sensor_cfg_usr.h
*         Sensors are initialized in the order as defined in sensor_cfg_usr.h
  *         LPS25HB supports pressure and temperature sensor
* @param  void 
  * @retval 
  */
MOBLE_RESULT Appli_Sensor_Init(void)                                        
  {
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;
   
  //MESH_MODEL_SENSOR_APP_CODE Begin
  /* Sensor Initialization */
  TRACE_M(TF_SENSOR, "VL53L0X init\r\n");
  VL53L0X_PROXIMITY_Init();
  TRACE_M(TF_SENSOR, "STTS22H init\r\n");
  STTS22H_Init_Sensor();

  /* Start measure of the distance */
  VL53L0X_Start_Measure();
  /* Start measure of the temperature */
  STTS22H_Start_Measure();
  //MESH_MODEL_SENSOR_APP_CODE End
  
  /* initialize sensor server model */
  result = SensorServer_Init(&BufferSensorServer, 
                              &AppliSensor_cb,
                              TOTAL_SENSOR_SERVER_BUFF_SIZE, 
                              &SensorServerInitParams);
      
  if(MOBLE_FAILED(result))
  {
    TRACE_M(TF_SENSOR, "Sensor Server init failed\r\n");
  }
  
  return result; 
  }


/**
  * @brief  Handling of serial inputs to sensor model
  * @param  Sensor offset in sensor init structure
  * @param  Sensor value
  * @retval void
  */
MOBLE_RESULT Appli_Sensor_Update(MOBLEUINT8 sensorOffset, MOBLEUINT32 value)
{
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;
  
  AppliSensorReadFromSensor = 1;
  
  /* Update previous with current and current with new */
  PreviousTemperatureValue = PresentTemperatureValue;
  PresentTemperatureValue = (MOBLEUINT8)value;
  
  /* To update cadence parameters
  results in either status trigger or (and) fast cadence based on change and present
  Application may decide not to update cadence parameters if senosr value is changing
  very frequently in some cases to save bandwidth */
  if (PresentTemperatureValue != PreviousTemperatureValue)
  {
    result = Sensor_UpdateCadence(sensorOffset, 
                                  SensorServerInitParams.sensorInitParams[0].elementIdx, 
                                  SensorServerInitParams.sensorInitParams[0].propertyId);
  }
  
  return result;
}


/**
  * @brief  Handling of serial inputs to sensor model
  *         Appli_Sensor_SerialCmd can be used for testing periodic publishing and 
  *         triggered publishing with PTS
  * @param  serial string
  * @param  serial string size
  * @retval void
  */
void Appli_Sensor_SerialCmd(char *rcvdStringBuff, uint16_t rcvdStringSize)
{
  MOBLE_RESULT result = MOBLE_RESULT_INVALIDARG;
  MOBLEUINT16 value = 0;
  MOBLEUINT8 sensorOffset = 0;
  
  if (!strncmp(rcvdStringBuff+6, "SETV", 4))
  {
    if (rcvdStringSize == 15)
    {
      sscanf(rcvdStringBuff+11, "%4hx", &value);
      
      /* Set SENSOR1 value at offset 0 */
      result = Appli_Sensor_Update(sensorOffset, value);
    }
    else
    {
      result = MOBLE_RESULT_FAIL;
      BLEMesh_PrintStringCb("Invalid size of string\r\n");
    }
  }
  else if (!strncmp(rcvdStringBuff+6, "PUBLISH", 7))
  {
    if (rcvdStringSize == 17)
    {
      sscanf(rcvdStringBuff+14, "%1hx", &value);
      
      sensorOffset = value;
      
      sscanf(rcvdStringBuff+16, "%1hx", &value);
      
      /* Enable / Disable publishing of sensor as identified by sensor offset */
      if(value == 0) /* Disable */
      {
        result = Sensor_UpdatePublishState(sensorOffset, 0);
      }
      else /* Enable */
      {
        result = Sensor_UpdatePublishState(sensorOffset, 1);
      }
    }
    else
    {
      result = MOBLE_RESULT_FAIL;
      BLEMesh_PrintStringCb("Invalid size of string\r\n");
    }
  }
  else
  {
    result = MOBLE_RESULT_FAIL;
  } 
  
  /* Check the result of command processing */
  if(result == MOBLE_RESULT_SUCCESS)
  {
    BLEMesh_PrintStringCb("Success\r\n");
  }
  else if(result == MOBLE_RESULT_OUTOFMEMORY)
  {
    BLEMesh_PrintStringCb("Fail Out of memory\r\n");  
  }
  else if(result == MOBLE_RESULT_INVALIDARG)
  {
    BLEMesh_PrintStringCb("Fail Invalid Argument\r\n");  
  }
  else
  {       
    BLEMesh_PrintStringCb("Fail\r\n");   
  }
}


/**
 * @}
 */

/**
 * @}
 */


